# School SAT Schore Performance Analysis: DataCamp Project02

## Task Description

![Movie popcorn on red background](schoolbus.jpg)

Every year, American high school students take **SATs**, which are standardized tests intended to measure literacy, numeracy, and writing skills. There are three sections - reading, math, and writing, each with a maximum score of 800 points. These tests are extremely important for students and colleges, as they play a pivotal role in the admissions process. <br> <br>

Analyzing the performance of schools is important for a variety of stakeholders, including policy and education professionals, researchers, government, and even parents considering which school their children should attend. <br> <br>

given dataset: `schools.csv` <br> <br>

Find out the three key questions about New York City (NYC) public school SAT performance.

- Which NYC schools have the best math results?

    - The best math results are at least 80% of the *maximum possible score of 800* for math.
    - Save your results in a pandas DataFrame called best_math_schools, including "school_name" and "average_math" columns, sorted by "average_math" in descending order.

- What are the top 10 performing schools based on the combined SAT scores?

    - Save your results as a pandas DataFrame called top_10_schools containing the "school_name" and a new column named "total_SAT", with results ordered by "total_SAT" in descending order.

- Which single borough has the largest standard deviation in the combined SAT score?

    - Save your results as a pandas DataFrame called largest_std_dev.
    - The DataFrame should contain one row, with:
        - "borough" - the name of the NYC borough with the largest standard deviation of "total_SAT".
        - "num_schools" - the number of schools in the borough.
        - "average_SAT" - the mean of "total_SAT".
        - "std_SAT" - the standard deviation of "total_SAT".
        - Round all numeric values to two decimal places.

## The data
### *schools.csv*
| Column | Description |
|--------|-------------|
| `school_name` | Name of the the school |
| `borough` | Borough Name |
| `building_code` | Building Code |
| `average_math` | Avg Score in Math |
| `average_reading` | Avg Score in Reading |
| `average_writing` | Avg Score in Writing |
| `percent_tested` | Percentage of Tested |

## Reading Data

In [1]:
import pandas as pd

In [2]:
schools = pd.read_csv("schools.csv")

schools.head()

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested
0,"New Explorations into Science, Technology and ...",Manhattan,M022,657,601,601,NaN
1,Essex Street Academy,Manhattan,M445,395,411,387,78.9
2,Lower Manhattan Arts Academy,Manhattan,M445,418,428,415,65.1
3,High School for Dual Language and Asian Studies,Manhattan,M445,613,453,463,95.9
4,Henry Street School for International Studies,Manhattan,M056,410,406,381,59.7

## Best Schools

Consdiering at least 80% score in Math.

In [3]:
best_math_schools = schools[schools['average_math'] >= .8 * 800][['school_name', 'average_math']]

In [4]:
best_math_schools['average_math'].describe() # checking if only 80% of 800 that is 640 onwards are included or not

count     10.000000
mean     689.200000
std       32.269008
min      641.000000
25%      671.750000
50%      682.500000
75%      708.500000
max      754.000000
Name: average_math, dtype: float64

### Sorting Best Schools in Descending Order

In [5]:
best_math_schools.sort_values('average_math', ascending=False, inplace=True)

In [6]:
best_math_schools.head()

                                           school_name  average_math
88                              Stuyvesant High School           754
170                       Bronx High School of Science           714
93                 Staten Island Technical High School           711
365  Queens High School for the Sciences at York Co...           701
68   High School for Mathematics, Science, and Engi...           683

## Top 10 Schools

Considering total SAT Scores to get the top 10 schools.

### Calculating & Sorting Total SAT Scores

In [7]:
schools['total_SAT'] = schools['average_math'] + schools['average_reading'] + schools['average_writing']
top_10_schools = schools.sort_values('total_SAT', ascending=False)
top_10_schools

,school_name,borough,building_code,average_math,average_reading,average_writing,percent_tested,total_SAT
88,Stuyvesant High School,Manhattan,M477,754,697,693,97.4,2144
170,Bronx High School of Science,Bronx,X445,714,660,667,97.0,2041
93,Staten Island Technical High School,Staten Island,R440,711,660,670,99.7,2041
174,High School of American Studies at Lehman College,Bronx,X905,669,672,672,91.8,2013
333,Townsend Harris High School,Queens,Q515,680,640,661,97.1,1981
...,...,...,...,...,...,...,...,...
171,Kingsbridge International High School,Bronx,X430,366,311,310,NaN,987
337,Pan American International High School,Queens,Q744,340,320,318,31.9,978
295,International High School at Prospect Heights,Brooklyn,K440,344,302,300,81.7,946
247,Multicultural High School,Brooklyn,K420,319,323,284,NaN,926
182,Pan American International High School at Monroe,Bronx,X420,317,315,292,65.6,924

### Getting the Top 10

In [8]:
top_10_schools = top_10_schools.loc[:, ['school_name', 'total_SAT']].head(10)
top_10_schools

                                           school_name  total_SAT
88                              Stuyvesant High School       2144
170                       Bronx High School of Science       2041
93                 Staten Island Technical High School       2041
174  High School of American Studies at Lehman College       2013
333                        Townsend Harris High School       1981
365  Queens High School for the Sciences at York Co...       1947
5                       Bard High School Early College       1914
280                     Brooklyn Technical High School       1896
45                       Eleanor Roosevelt High School       1889
68   High School for Mathematics, Science, and Engi...       1889

## Most Deviated Borough

### Grouping Boroughs

Calculating number of schools and both average and standard deviation of Total SAT Score. Finally sorting them by std in descending order.

In [9]:
data = schools.groupby('borough')['total_SAT'].agg(['count', 'mean', 'std']).sort_values('std', ascending=False)

### Getting the Top Borough

In [10]:
largest_std_dev = data.head(1)
largest_std_dev

           count         mean        std
borough
Manhattan     89  1340.134831  230.29414

In [11]:
largest_std_dev.reset_index(inplace=True)
largest_std_dev

     borough  count         mean        std
0  Manhattan     89  1340.134831  230.29414

In [12]:
largest_std_dev.columns

Index(['borough', 'count', 'mean', 'std'], dtype='object')

### Renaming the column names

In [13]:
col_labels = ['borough', 'num_schools', 'average_SAT', 'std_SAT']
largest_std_dev.columns = [x for x in col_labels]

largest_std_dev

     borough  num_schools  average_SAT    std_SAT
0  Manhattan           89  1340.134831  230.29414

### Rounding Numeric Values

2 Decimal

In [14]:
largest_std_dev.loc[:]['average_SAT'] = largest_std_dev['average_SAT'].round(2)
largest_std_dev.loc[:]['std_SAT'] = largest_std_dev['std_SAT'].round(2)

In [16]:
largest_std_dev

     borough  num_schools  average_SAT  std_SAT
0  Manhattan           89      1340.13   230.29